# GetFlowConvertionServerInfo Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeSettings..::..GetFlowConvertionServerInfo Method
PipeSettings Class See Also
---
Get the MEPServerInfo of the current plumbing flow convertion server.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public MEPCalculationServerInfo GetFlowConvertionServerInfo()
```

Visual Basic
---
```text
Public Function GetFlowConvertionServerInfo As MEPCalculationServerInfo
```

Visual C++
---
```text
public:
MEPCalculationServerInfo^ GetFlowConvertionServerInfo()
```

# ### Return Value
The MEPServerInfo of the current plumbing flow convertion server.
# See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace